
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Контрагент.Префикс;
КонецПроцедуры

Процедура ПрименитьСкидкуКДокументу (Процент) Экспорт
	
	Если ТипЗнч(Процент) <> Тип("Число") Или Процент < 0 Или Процент > 100 Тогда
		ВызватьИсключение "Не корректный процент";
	КонецЕсли;
	
	Коэффициент = 1 - (Процент/100);
	
	Для Каждого Строка Из ТабличнаяЧасть1 Цикл 
		Строка.Цена = Строка.Цена * Коэффициент;
		Строка.Сумма = Строка.Цена * Строка.Количество;
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
КонецПроцедуры     

Процедура РассчитатьСуммуДокумента()
	СуммаДокумента = ТабличнаяЧасть1.Итог("Сумма");
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РассчитатьСуммуДокумента();

КонецПроцедуры
