Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма) Экспорт
	
	// Группа Скидки - не добавляется на форме и при ссылке на нее при добавлении ПоляВвода - ошибка
	
	ГруппаСкидки = Форма.Элементы.Добавить("НЕТО_ГруппаСкидка", Тип("ГруппаФормы"),Форма.Элементы.КонтрагентКонтЛицо);
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидки.ОтображатьЗаголовок = Истина;
	ГруппаСкидки.Заголовок = "Группа скидки";
	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	//добавление элемента Формы
	ПолеВвода = Форма.Элементы.Добавить("НЕТО_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_СогласованнаяСкидка";
КонецПроцедуры
