

&НаКлиенте
Процедура СтажРаботыУровеньДолжностиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтажРаботы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.УровеньДолжности = "Стажер" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 1;
	ИначеЕсли 
		ТекущиеДанные.УровеньДолжности = "Профессионал" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 2.5;
	ИначеЕсли 
		ТекущиеДанные.УровеньДолжности = "Специалист" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 7;
	ИначеЕсли 
		ТекущиеДанные.УровеньДолжности = "Эксперт" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 10;
	ИначеЕсли 
		ТекущиеДанные.УровеньДолжности = "ТаймЛидер" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 15;
	ИначеЕсли 
		ТекущиеДанные.УровеньДолжности = "Руководитель" Тогда
		ТекущиеДанные.КоэффициентПоДолжности = 20;
	Иначе
		ТекущиеДанные.КоэффициентПоДолжности = 0;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СтажРаботыПриИзменении(Элемент)
	ВсегоСтаж = 0;
	Коэффициент = 0;
	
	Для Каждого Строка Из СтажРаботы Цикл
		ВсегоСтаж = ВсегоСтаж + Строка.Стаж;
		Коэффициент = Коэффициент + (Строка.Стаж * Строка.КоэффициентПоДолжности);
	КонецЦикла;
	
	Если ВсегоСтаж = 0 Тогда
		Процент = 0;
		Возврат;
	КонецЕсли;
	
	Процент = Коэффициент / ВсегоСтаж;
	
КонецПроцедуры


&НаКлиенте
Процедура Готово(Команда)
	ОповеститьОВыборе(Процент);
КонецПроцедуры

