
&НаКлиенте
Процедура ПроверкаТиповОбъектов(Команда)
	ПроверкаТиповОбъектовСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверкаТиповОбъектовСервер()
	Сообщить(ТипЗнч(Объект));
	ОбъектБД = РеквизитФормыВЗначение("Объект");
	Сообщить(ТипЗнч(ОбъектБД));
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура", ВыбранноеЗначение);
	
	СтрокиТаблицы = Объект.Товары.НайтиСтроки(ОтборСтрок);
	
	Если СтрокиТаблицы.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
КонецПроцедуры
