

&НаКлиенте
Процедура ПроверкаТиповОбъектов2(Команда)
	ПроверкаТиповОбъектов2Сервер();
КонецПроцедуры

&НаСервере
Процедура ПроверкаТиповОбъектов2Сервер()
	ОбъектБД = РеквизитФормыВЗначение("Объект");
	ОбъектБД.ПрименитьСкидкуКДокументу(10);
	ЗначениеВРеквизитФормы(ОбъектБД,"Объект")
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСоСписком", ПараметрыФормы, Элементы.ТабличнаяЧасть1);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧасть1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ЗначениеСписка Из ВыбранноеЗначение Цикл
		СсылкаНаНоменклатуру = ЗначениеСписка.Значение;
		
		НоваяСтрока = Объект.ТабличнаяЧасть1.Добавить();
		НоваяСтрока.Номенклатура = СсылкаНаНоменклатуру;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ДобавитьГруппуСервер.ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
